<?php 

// 1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.

$i=0;
while($i++ < 100){
    if($i%3==0){
        echo $i.'<br>';
    }; 
}



// 2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:

//     0 – ноль.
//     1 – нечетное число.
//     2 – четное число.
//     3 – нечетное число.
//     …
//     10 – четное число.
echo '<br>';

$i = 0;
do {
    if ($i == 0){
        echo $i . ' - ноль' . '<br>';
    }
    elseif ($i%2 == 0){
            echo $i . ' - четное число' . '<br>';
        }
    else{
        echo $i . ' - нечетное число' . '<br>';
    }
    $i++;
}
while ($i <= 10); 



// 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
// а в качестве значений – массивы с названиями городов из соответствующей области. 
// Вывести в цикле значения массива, чтобы результат был таким:

//     Московская область:
//     Москва, Зеленоград, Клин
//     Ленинградская область:
//     Санкт-Петербург, Всеволожск, Павловск, Кронштадт
//     Рязанская область … (названия городов можно найти на maps.yandex.ru)
echo '<br>';

$region = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'], 
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Ряжск', 'Касимов']
];
foreach ($region as $key => $value) {
    echo $key.':<br>';
    $str = implode(", ", $value);
    echo $str.'<br>';
}



// 4. Объявить массив, индексами которого являются буквы русского языка, 
// а значениями – соответствующие латинские буквосочетания 
// (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).

// Написать функцию транслитерации строк.
echo '<br>';

$string = "транслитерация строк";

$translit = array("а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", 
                  "е" => "e", "ё" => "e", "ж" => "zh", "з" => "z", "и" => "i", 
                  "й" => "y", "к" => "k", "л" => "l", "м" => "m", "н" => "n", 
                  "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", 
                  "у" => "u", "ф" => "f", "х" => "kh", "ц" => "c", "ч" => "ch",  
                  "ш" => "sh",  "щ" => "sch", "ь" => "", "ы" => "y", "ъ" => "", 
                  "э" => "e", "ю" => "yu", "я" => "ya", "А" => "A", "Б" => "B", 
                  "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E", "Ё" => "E", 
                  "Ж" => "Zh",  "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K", 
                  "Л" => "L", "М" => "M", "Н" => "N", "О" => "O", "П" => "P", 
                  "Р" => "R", "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", 
                  "Х" => "KH", "Ц" => "C", "Ч" => "Ch", "Ш" => "Sh", "Щ" => "Sch", 
                  "Ь" => "",  "Ы" => "Y", "Ъ" => "", "Э" => "E", "Ю" => "Yu", "Я" => "Ya");
 
echo $string.' - '.strtr($string, $translit);



// 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.
echo '<br>';

$text='Меняем пробелы на подчеркивания';
echo str_replace(' ', '_', $text); 




// 6. В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. 
// Необходимо представить пункты меню как элементы массива и вывести их циклом. 
// Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.
echo '<br>';
?>

<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>Меню генерируемое через PHP</title>
</head>
<body>

    <?php

        // ВАРИАНТ БЕЗ ВЛОЖЕННОСТИ
        // $menu = [
        //     ['link'=>'Главная', 'href'=>'#'],
        //     ['link'=>'Каталог', 'href'=>'#'],
        //     ['link'=>'Акции', 'href'=>'#'],
        //     ['link'=>'Доставка', 'href'=>'#'],
        //     ['link'=>'О нас', 'href'=>'#'],
        // ];

        // echo '<ul>';
        // foreach ($menu as $item){
        //     echo "<li><a href='$item[href]'>$item[link]</a></li>";
        // }
        // echo '</ul>';

        //ВАРИАНТ С ВЛОЖЕННОСТЬЮ
        $menu = [
            'Главная'=>[
                'href'=>'#',
                'submenu'=>'empty'
            ],
            'Каталог'=>[ 
                'href'=>'#',
                'submenu'=>[
                    ['link'=>'Женская одежда', 'href'=>'#'], 
                    ['link'=>'Мужская одежда', 'href'=>'#'], 
                    ['link'=>'Детская одежда', 'href'=>'#']
                ]
            ],
            'Акции'=>[ 
                'href'=>'#',
                'submenu'=>'empty'
            ],
            'Доставка'=>[ 
                'href'=>'#',
                'submenu'=>'empty'
            ],
            'О нас'=>[
                'href'=>'#',
                'submenu'=>'empty'
            ],
        ];
    
        echo '<ul>';
        foreach($menu as $menuLink => $properties){
            if(is_array($properties['submenu'])){
                echo "<li><a href='$properties[href]'>$menuLink</a><ul>";
                foreach($properties['submenu'] as $submenuLink){
                    echo "<li><a href='$submenuLink[href]'>".$submenuLink['link']."</a></li>";
                }
                echo "</ul>";        
            }
            else{
                echo "<li><a href='$properties[href]'>$menuLink</a></li>";
            }           
        }
        echo "</ul>"
    ?> 
</body>
</html>



<?php
// 7. *Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно так:
//     for (…){ // здесь пусто}
echo '<br>';

for($i = 0; print $i, $i++ < 9;);



// 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
echo '<br>';

foreach ($region as $key => $value) {
    echo $key.':<br>';
    foreach ($value as $key => $value) {
        if(mb_substr($value, 0, 1) == 'К') {
            echo $value.'<br>';
        }
    }
}
?>
